GuvHas/threadics/sdkconfig.defaults
# Target board and SoC
CONFIG_IDF_TARGET="esp32c6"

# OpenThread + Matter over Thread + BLE commissioning
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_FTD=y

# Pin OpenThread router-role thresholds explicitly so behaviour is documented
# and stable across SDK/OpenThread upgrades.
CONFIG_OPENTHREAD_MAX_ROUTERS=32
CONFIG_OPENTHREAD_ROUTER_UPGRADE_THRESHOLD=16
CONFIG_OPENTHREAD_ROUTER_DOWNGRADE_THRESHOLD=23

# Persist Thread network credentials across reboots.
CONFIG_OPENTHREAD_NVS_PERSIST=y

# BLE discovery for commissioning
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_ENABLE_CHIPOBLE=y

# Route all Matter credentials to the protected nvs_matter partition.
CONFIG_CHIP_FACTORY_NAMESPACE_PARTITION_LABEL="nvs_matter"
CONFIG_CHIP_CONFIG_NAMESPACE_PARTITION_LABEL="nvs_matter"
CONFIG_ESP_MATTER_NVS_PART_NAME="nvs_matter"

# OTA disabled: no ota_0/ota_1 partitions in this partition table.
CONFIG_ENABLE_OTA_REQUESTOR=n

# Disable CHIP's WiFi NetworkCommissioning driver and WiFi station so that
# only the Thread NetworkCommissioning cluster is advertised to commissioners.
#
# Without these, esp_matter::start() registers both WiFi and Thread clusters
# and Home Assistant may attempt WiFi commissioning even with a Thread Border
# Router available. Also prevents ConnectivityManagerImpl from requiring
# WiFi-specific methods it does not implement in Thread-only builds.
CONFIG_WIFI_NETWORK_COMMISSIONING_DRIVER=n
CONFIG_ENABLE_WIFI_STATION=n

# FreeRTOS tick rate: 1000 Hz gives 1 ms resolution for MRP retransmission
# timers, Thread MLE timeouts, and Matter subscription reporting intervals.
CONFIG_FREERTOS_HZ=1000

# Matter device identity shown in Home Assistant and other controllers.
CONFIG_DEVICE_PRODUCT_NAME="LK Floor heating"

# RS485 pin mapping for Seeed XIAO ESP32-C6 top header (no soldering required).
# D0=GPIO0 (TX), D1=GPIO1 (RX).  DE stays on GPIO10 (internal, not exposed on
# any header pad) — the Waveshare TTL->RS485 (C) module drives DE automatically
# from the TX line, so nothing needs to be connected to the DE pin.
CONFIG_LK_ICS2_UART_TX_PIN=0
CONFIG_LK_ICS2_UART_RX_PIN=1
CONFIG_LK_ICS2_RS485_DE_PIN=10

# Matter + logging defaults
CONFIG_ESP_MATTER_ENABLE_DATA_MODEL=y
CONFIG_LOG_DEFAULT_LEVEL=2
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y

# mbedTLS features required by esp_matter/CHIP
CONFIG_MBEDTLS_HKDF_C=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash size (required by custom partition table)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Coredump to flash (ELF format for gdb)
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# Main task stack: Matter/Thread init path needs >3584 byte default
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# UART ISR in IRAM for reliable RS485 timing under cache pressure
CONFIG_UART_ISR_IN_IRAM=y
